Repository: deralexxx/www-l10n
Catalog: translations/*/JobID25_*.xlf
Languages: de

# 298][body][0][value
source: <a name="about"></a> <div class="section"> <h2>About</h2> For years, privacy and security experts worldwide have called on the general public to adopt strong, open-source cryptography to protect our communications. The Snowden revelations have confirmed our worst fears: governments are spying on our digital lives, grabbing up communications transmitted in the clear. Given widespread government surveillance, why don’t people routinely use tools to encrypt their communications? Wouldn’t we all communicate a little more freely without the shadow of surveillance? It boils down to two things: security and usability. Most of the tools that are easy for the general public to use don’t rely on security best practices--including end-to-end encryption and open source code. Messaging tools that are really secure often aren’t easy to use; everyday users may have trouble installing the technology, verifying its authenticity, setting up an account, or may accidentally use it in ways that expose their communications. EFF, in collaboration with Julia Angwin at ProPublica and Joseph Bonneau at the Princeton Center for Information Technology Policy, are joining forces to launch a campaign for secure and usable crypto. We are championing technologies that are strongly secure and also simple to use. The Secure Messaging Scorecard examines dozens of messaging technologies and rates each of them on a range of security best practices. Our campaign is focused on communication technologies -- including chat clients, text messaging apps, email applications, and video calling technologies. These are the tools everyday users need to communicate with friends, family members, and colleagues, and we need secure solutions for them. We chose technologies that have a large user base--and thus a great deal of sensitive user communications--in addition to smaller companies that are pioneering advanced security practices. We’re hoping our scorecard will serve as a race-to-the-top, spurring innovation around strong crypto for digital communications. </div> <a name="methodology"></a> <div class="section"> <h2>Methodology</h2> <p dir="ltr">Here are the criteria we looked at in assessing the security of various communication tools.</p> <p dir="ltr"><a name="encrypted"></a><strong>1. Is your communication encrypted in transit?</strong> This criterion requires that all user communications are encrypted along all the links in the communication path. Note that we are not requiring encryption of data that is transmitted on a company network, though that is ideal. We do not require that metadata (such as user names or addresses) is encrypted.</p> <a name="encrypted"></a> <p dir="ltr"><a name="encrypted"></a><a name="e2e"></a><strong>2.</strong> <strong>Is your communication encrypted with a key the provider doesn't have access to?</strong> This criterion requires that all user communications are end-to-end encrypted. This means the keys necessary to decrypt messages must be generated and stored at the endpoints (i.e. by users, not by servers). The keys should never leave endpoints except with explicit user action, such as to backup a key or synchronize keys between two devices. It is fine if users' public keys are exchanged using a centralized server.</p> <a name="e2e"></a> <p dir="ltr"><a name="e2e"></a><a name="verify"></a><strong>3.</strong> <strong>Can you independently verify your correspondent's identity?</strong>{tjiid298-43}This criterion requires that a built-in method exists for users to verify the identity of correspondents they are speaking with and the integrity of the channel, even if the service provider or other third parties are compromised. Two acceptable solutions are:</p> <ul><li dir="ltr"> <p dir="ltr"><a name="verify"></a>An interface for users to view the fingerprint (hash) of their correspondent's public keys as well as their own, which users can verify manually or out-of-band.</p> </li> <li dir="ltr"> <p dir="ltr"><a name="verify"></a>A key exchange protocol with a short-authentication-string comparison, such as the <a href="http://en.wikipedia.org/wiki/Socialist_millionaire" style="line-height: 1.538em;">Socialist Millionaire's protocol</a>.</p> </li> </ul><p dir="ltr">Other solutions are possible, but any solution must verify a binding between users and the cryptographic channel which has been set up. For the scorecard, we are simply requiring that a mechanism is implemented and not evaluating the usability and security of that mechanism.</p> <p dir="ltr"><a name="pfs"></a><strong>4.</strong> <strong>Are past communications secure if your keys are stolen?</strong> This criterion requires that the app provide <a href="https://www.eff.org/deeplinks/2013/08/pushing-perfect-forward-secrecy-important-web-privacy-protection">forward secrecy</a>, that is, all communications must be encrypted with ephemeral keys which are routinely deleted (along with the random values used to derive them). It is imperative that these keys cannot be reconstructed after the fact by anybody even given access to both parties' long-term private keys, ensuring that if users choose to delete their local copies of correspondence, they are permanently deleted. Note that this criterion requires criterion 2, end-to-end encryption.</p> <p dir="ltr"><em style="line-height: 20.0063037872314px;">Note: For this phase of the campaign, we accept a hybrid forward-secrecy approach with forward secrecy on the transport layer (for example through TLS with a Diffie-Hellman cipher suite) and non-forward-secret end-to-end encryption, plus an explicit guarantee that ciphertexts are not logged by the provider. This is a compromise as it requires trusting the provider not to log ciphertexts, but we prefer this setup to having no forward secrecy at all.</em></p> <p dir="ltr"><a name="open"></a><strong>5.</strong> <strong>Is the code open to independent review?</strong> This criterion requires that sufficient source-code has been published that a compatible implementation can be independently compiled. Although it is preferable, we do not require the code to be released under any specific free/open source license. We only require that all code which could affect the communication and encryption performed by the client is available for review in order to detect bugs, back doors, and structural problems.</p> <a name="open"></a><em>Note: when tools are provided by an operating system vendor, we only require code for the tool and not the entire OS. This is a compromise, but the task of securing OSes and updates to OSes is beyond the scope of this project.</em> <a name="open"></a> <p dir="ltr"><a name="open"></a><a name="documented"></a><strong>6. Is the crypto design well-documented?</strong> This criterion requires clear and detailed explanations of the cryptography used by the application. Preferably this should take the form of a white-paper written for review by an audience of professional cryptographers. This must provide answers to the following questions:</p> <ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>Which algorithms and parameters (such as key sizes or elliptic curve groups) are used in every step of the encryption and authentication process</p> </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>How keys are generated, stored, and exchanged between users</p> </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>The life-cycle of keys and the process for users to change or revoke their key</p> </li> <li dir="ltr"> <p dir="ltr"><a name="documented"></a>A clear statement of the properties and protections the software aims to provide (implicitly, this tends to also provide a threat model, though it's good to have an explicit threat model too). This should also include a clear statement of scenarios in which the protocol is not secure. </p> </li> </ul><a name="documented"></a> <p dir="ltr"><a name="documented"></a><a name="audited"></a><strong>7.</strong> <strong>Has there been an independent security audit?</strong></p> <p dir="ltr"><a name="audited"></a>This criterion requires an independent security review has been performed within the 12 months prior to evaluation. This review must cover both the design and the implementation of the app and must be performed by a named auditing party that is independent of the tool's main development team. Audits by an independent security team within a large organization are sufficient. Recognizing that unpublished audits can be valuable, we do not require that the results of the audit have been made public, only that a named party is willing to verify that the audit took place.</p> <p dir="ltr">We've discussed this criterion in depth in a Deeplinks post: <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">What Makes a Good Security Audit?</a>{tjiid298-148} </p> </div> <a name="about"></a> <div class="section"><a name="changelog"></a> <h2>Changelog</h2> Entries in the <a href="#">Secure Messaging Scorecard</a> were checked with the listed projects and companies when the Scorecard launched on 2014-11-06. Updates will be made if the listees or others inform us of changes or inaccuracies. A log of all such changes is below: <ul style="font-size: 13.0080003738403px; line-height: 20.0063037872314px;"><li><strong style="line-height: 20.0063037872314px;">2015-06-12</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>We removed Secret as the service was <a href="https://medium.com/secret-den/sunset-bc18450478d5" title="Secret sunset">shut down</a> in May 2015.</li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-03-06</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>We credited QQ for completing an independent internal security audit (<span style="color: #008000;">✓</span>)<span style="line-height: 20.0063037872314px;">.</span></li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-02-17</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>We credited Telegram (both secret and regular mode) for undergoing a code audit in February 2015 <span style="line-height: 20.0063037872314px;">(</span><span style="line-height: 20.0063037872314px; color: #008000;">✓</span><span style="line-height: 20.0063037872314px;">).</span></li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-01-29</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li><span style="line-height: 20.0063037872314px;">We have credited QQ for encrypting messages in transit </span><span style="line-height: 20.0063037872314px;">(</span><span style="color: #008000;">✓</span><span style="line-height: 20.0063037872314px;">). Though QQ does not use TLS/SSL, which is considered best practice, they have implemented a custom protocol for message encryption in transit.</span></li> <li><span style="line-height: 20.0063037872314px;">We have clarified our scoring for forward secrecy (criterion #4).</span></li> </ul></li> <li><strong style="line-height: 1.538em;">2015-01-05</strong><span style="line-height: 1.538em;"> :</span> <ul><li><span style="line-height: 1.538em;">We have split the scoring for Telegram into two rows: baseline Telegram and Telegram secret chats. Baseline Telegram chats are not end-to-end encrypted so that the provider can't read them (</span><span style="color: #ff0000;" data-mce-mark="1">✘</span><span style="line-height: 1.538em;">). Telegram secret chats are, and in addition Telegram now </span><a href="https://core.telegram.org/api/pfs" title="Telegram perfect forward secrecy blog post" style="line-height: 1.538em;">supports perfect forward secrecy</a><span style="line-height: 1.538em;"> so that messages can be securely deleted (</span><span style="color: #008000;" data-mce-mark="1">✓</span><span style="line-height: 1.538em;">)</span></li> <li><span style="line-height: 1.538em;">Wickr now provides the ability to verify contact's identities by exposing key fingerprints, which can be verified out-of-band or through in-band video. (</span><span style="line-height: 1.538em;">✓</span><span style="line-height: 1.538em;">)</span></li> </ul></li> </ul><ul><li><strong>2014-11-14</strong> : <ul><li>RIM has told us that BlackBerry Messenger Protected uses an <a href="http://docs.blackberry.com/en/admin/deliverables/64972/BBM_Protected-Security_Note_en.pdf">out-of-band passphrase exchange</a> and <a href="https://en.wikipedia.org/wiki/SPEKE_(cryptography)">EC-SPEKE</a> to perform identity verification. (✓) RIM has also told us that BBM Protected receives security reviews by an internal security team. (✓)</li> <li>Viber has received a recent external security audit from EY Advanced Security Center. (✓)</li> <li>Pidgin has documented a number of auditing processes including regular use of static analysis tools and audits by a team at Cisco Talos. The Pidgin developers were clear that they do not know how thorough and complete these audits have been, but the audits nonetheless <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">meet our criteria</a>. (✓) Although auditing of Pidgin improves the security of the related Adium project (the projects share many components including libpurple, libotr, and libxml2), the Adium developers tell us that besides occasional static analysis by the developers themselves they are not aware of any independent auditing effort that addresses the Adium-specific code. So for the time being that project will not receive an audit checkmark.</li> </ul></li> <li><strong>2014-11-10</strong> : Skype check mark for end-to-end encryption <a href="https://www.eff.org/deeplinks/2014/11/scorecard-update-we-cannot-credit-skype-end-end-encryption">removed</a>. (✘)</li> <li><strong>2014-11-04</strong> : Snapchat app has audits from an internal security team. (✓)</li> </ul></div>
de: <a name="about"></a> <div class="section"> <h2>Über</h2> Jahrelang haben Privacy- und Sicherheitsexperten die Öffentlichkeit dazu aufgerufen, Open Source Kryptographie zum Schutz unserer Kommunikation anzunehmen. Die Snowden Veröffentlichungen haben unsere schlimmsten Befürchtungen bestätigt: Regierungen sind spionieren in unserem digitalen Leben und überwachen im Klartext übertragene Kommunikation. Angesichts der weit verbreiteten Überwachung von Regierungen, warum verwenden Leute nicht routinemäßig Tools um ihre Kommunikation zu verschlüsseln? Würden wir nicht alle etwas freier kommunizieren, ohne den Schatten der Überwachung zu fürchten? Es läuft auf zwei Dinge hinaus: Sicherheit und Benutzerfreundlichkeit. Die meisten Tools, die einfach für die Allgemeinheit zu verwenden sind, basieren nicht auf Sicherheit durch best-practices --einschließlich End-to-End Verschlüsselung und open-Source-Code. Messaging-Tools, die wirklich sicher sind, sind oft nicht einfach zu bedienen; normale Benutzer haben möglicherweise Probleme bei der Installation, der Technik zur Verifizierung seiner Authentizität, die Einrichtung eines Kontos oder verwenden es versehentlich auf Arten, die ihre Kommunikation überwachbar machen. EFF, in Zusammenarbeit mit Julia Angwin bei ProPublica und Joseph Bonneau am Princeton Center for Information Technology Policy kommen zusammen um gemeinsam eine Kampagne für sicheres und nutzbare Crypto starten. Wir sind verfechten Technologien, die stark, sicher und auch einfach zu bedienen sind. Die Secure Messaging-Scorecard untersucht Dutzende von messaging-Technologien und bewertet jeder von ihnen auf eine Reihe von best Practices in Bezug Sicherheit. Unsere Kampagne konzentriert sich auf Informations-und Kommunikationstechnologien--einschließlich der aufrufenden Videotechnologien Chatclients, Text-messaging-Anwendungen und e-Mail-Anwendungen. Dies sind die Werkzeuge, die täglichen Benutzer mit Freunden, Familienmitgliedern und Kollegen kommunizieren müssen und wir brauchen sichere Lösungen für sie. Wir wählten Technologien, die eine große Benutzerbasis haben und somit viel sensiblere Benutzerkommunikation, neben kleineren Unternehmen, die wegweisend sind in Bezug auf erweiterte Sicherheitsmaßnahmen. Wir hoffen, dass unsere Scorekarte als eine Herausforderung gesehen wird und Innovationen treiben wird und die Verschlüsselung in digitaler Kommunikation verbessert. </div> <a name="methodology"></a> <div class="section"> <h2>Methodik</h2> <p dir="ltr">Hier sind die Kriterien, die wir bei der Beurteilung der Sicherheit der verschiedenen Kommunikations-Tools beachten.</p> <p dir="ltr"><a name="encrypted"></a><strong>1. Wird Ihre Kommunikation bei der Übertragung verschlüsselt?</strong> Dieses Kriterium erfordert, dass alle Benutzerkommunikation entlang aller Links im Kommunikationspfad verschlüsselt sind. Beachten Sie, dass wir nicht erwarten, dass Daten, welche in einem Unternehmensnetzwerk übertragen werden, verschlüsselt sind. Wir erwarten nicht, dass Metadaten (z.B: Benutzernamen oder Adressen) verschlüsselt werden.</p> <a name="encrypted"></a> <p dir="ltr"><a name="encrypted"></a><a name="e2e"></a><strong>2.</strong> <strong>Wird Ihre Kommunikation wird mit einem Schlüssel verschlüsselt, die der Anbieter nicht Zugriff zu haben?</strong> Dieses Kriterium erfordert, dass alle Benutzerkommunikation Ende-zu-Ende-verschlüsselt sind. Das bedeutet, die zum Entschlüsseln von Nachrichten erforderlichen Schlüssel müssen an den Endpunkten generiert und gespeichert werden (d. h. von Benutzern, nicht von Servern). Die Schlüssel sollten Endpunkte, mit Ausnahme expliziter Benutzeraktion, wie z.B. Backup eines Schlüssels oder zum Abgleich von Schlüsseln zwischen zwei Geräten, niemals verlassen. Es ist gut, wenn der öffentliche Schlüssel von Benutzern mit einem zentralisierten Server ausgetauscht werden.</p> <a name="e2e"></a> <p dir="ltr"><a name="e2e"></a><a name="verify"></a><strong>3.</strong> <strong>Können Sie selbständig die Identität des Kommunikationspartners verifizieren? </strong>{tjiid298-43} Dieses setzt built-in Methoden für den Nutzer voraus, mit denen er die Identität für Benutzer überprüfen und den Kommunikationskanal in Hinblick auf Integrität gewährleisten kann. Auch wenn Dienstleister oder sonstige Dritte kompromittiert sind. Zwei akzeptable Lösung sind:</p> <ul><li dir="ltr"> <p dir="ltr"><a name="verify"></a>Eine Schnittstelle für Benutzer den Fingerabdruck (Hash) ihre Korrespondent öffentlicher Schlüssel sowie ihre eigenen, welche Benutzer manuell überprüfen können oder Out-of-Band-anzeigen.</p> </li> <li dir="ltr"> <p dir="ltr"><a name="verify"></a>A key exchange protocol with a short-authentication-string comparison, such as the <a href="http://en.wikipedia.org/wiki/Socialist_millionaire" style="line-height: 1.538em;">Socialist Millionaire's protocol</a>.</p> </li> Andere Lösungen sind möglich, aber jede Lösung muss eine Bindung zwischen dem Benutzer und der kryptografischen Channel, der eingerichtet wurde, überprüfen. <p dir="ltr"><a name="pfs"></a><strong>4.</strong> <p dir="ltr"><em style="line-height: 20.0063037872314px;">Hinweis: Für diese Phase der Kampagne Wir akzeptieren einen Hybridansatz vorwärts-Geheimhaltung mit forward Geheimhaltung auf der Transportschicht (z. B. durch TLS mit einem Diffie-Hellman-Chiffre-Suite) und nicht vorwärts-geheime End-to-End Verschlüsselung sowie eine Garantie, die nicht Ciphertexts sind vom Provider protokolliert. <p dir="ltr"><a name="open"></a><strong>5.</strong> <strong>Ist der Code für unabhängige Überprüfung offen?</strong> Dieses Kriterium ist erforderlich, dass diese ausreichend Quellcode veröffentlicht wurde, dass eine kompatible Implementierung unabhängig kompiliert werden kann. <a name="open"></a> <p dir="ltr"><a name="open"></a><a name="documented"></a><strong>6. Ist das Krypto Design gut dokumentiert? </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>Wie Schlüssel generiert, gespeichert und zwischen Benutzern ausgetauscht werden</p> </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>Der Lebenszyklus von Schlüsseln und den Prozess für Benutzer zu ändern oder wenn ihre Schlüssel zurückgezogen werden</p> </li> <li dir="ltr"> Eine klare Aussage der Eigenschaften und der Schutz die Software soll (implizit, dies tendenziell bieten auch eine Bedrohung-Modell, aber es ist gut, eine explizite Bedrohungsmodell zu haben). </p> </li> </ul><a name="documented"></a> <p dir="ltr"><a name="documented"></a><a name="audited"></a><strong>7.</strong> <strong>Gab es eine unabhängige Sicherheitsprüfung?</strong></p> <p dir="ltr"><a name="audited"></a>Dieses Kriterium ist erforderlich, dass innerhalb von zwölf Monaten vor der Bewertung eine unabhängigen Sicherheitsüberprüfung durchgeführt wurde. Diese Überprüfung erstreckt sich das Design und die Umsetzung der app und muss von einer benannten Rechnungsprüfung Partei, die unabhängig von das Tool Hauptentwicklung Team durchgeführt werden. </p> </div> <a name="about"></a> <div class="section"><a name="changelog"></a> <h2>Changelog</h2> Einträge in der Secure Messaging-Scorecard wurden mit den aufgeführten Projekte und Unternehmen überprüft, wenn die Scorecard auf 2014-11-06 gestartet. <ul style="font-size: 13.0080003738403px; line-height: 20.0063037872314px;"><li><strong style="line-height: 20.0063037872314px;">2015-06-12</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>Wir entfernten das Secret, da der Dienst <a href="https://medium.com/secret-den/sunset-bc18450478d5" title="Secret sunset">heruntergefahren wurde</a> im Mai 2015.</li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-03-06</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>Wir haben uns bei QQ für Abschluss einer unabhängigen internen Security-Audit zu bedanken. (<span style="color: #008000;">✓</span>)<span style="line-height: 20.0063037872314px;">.</span></li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-02-17</strong><span style="line-height: 20.0063037872314px;"> :</span> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-01-29</strong><span style="line-height: 20.0063037872314px;"> :</span> </ul></li> <li><strong style="line-height: 1.538em;">2015-01-05</strong><span style="line-height: 1.538em;"> :</span> </ul></li> </ul><ul><li><strong>2014-11-14</strong> : </ul></li> <li><strong>2014-11-10</strong> : <li><strong>2014-11-04</strong> : Snapchat app hatte eine Prüfungen durch das eigene internen Sicherheitsteam. (✓)</li> </ul></div>

# 298][body][0][summary
source: <h3>Which apps and tools actually keep your messages safe?</h3> <div class="section"> In the face of widespread Internet surveillance, we need a secure and practical means of talking to each other from our phones and computers. Many companies offer “secure messaging” products—but are these systems actually secure? We decided to find out, in the first phase of a new EFF Campaign for Secure &amp; Usable Crypto. This scorecard represents only the first phase of the campaign. In later phases, we are planning to offer closer examinations of the usability and security of the tools that score the highest here. As such, <span style="text-decoration: underline;">the results in the scorecard below should not be read as endorsements of individual tools or guarantees of their security</span>; they are merely indications that the projects are on the right track. For practical advice and tutorials on how to protect your online communication against surveillance, check out EFF's <a href="https://ssd.eff.org/">Surveillance Self-Defense</a> guide. </div>
de: Welche apps und Tools behalten Ihre Nachrichten tatsächlich sicher? <div class="section"> Angesichts der weit verbreiteten Internet-Überwachung benötigen wir eine sichere und praktische Mittel aus unsere Telefone und Computer miteinander zu reden. </div>
