Repository: deralexxx/www-l10n
Catalog: translations/*/JobID25_*.xlf
Languages: de

# 294][body][0][value
source: <p>This page answers frequently-asked questions about EFF's <a href="/https-everywhere">HTTPS Everywhere</a> project. If your question isn't answered below, you can try the resources <a href="/https-everywhere/development">listed here</a>.</p>
de: <p>Diese Seite beantwortet häufig gestellte Fragen zur EFFs <a href="/https-everywhere">HTTPS Everywhere</a> -Projekt. Wenn Ihre Frage beantwortet ist nicht, probieren Sie die hier aufgeführten Ressourcen.

# 294][field_questions][0][question
source: What if HTTPS Everywhere breaks some site that I use?
de: Was, wenn HTTPS Everywhere einige Website, die ich verwende unbenutzbar macht?

# 294][field_questions][0][answer
source: <p></p><a name="bugs"></a><p>This is occasionally possible because of inconsistent support for HTTPS on sites (e.g., when a site seems to support HTTPS access but makes a few, unpredictable, parts of the site unavailable in HTTPS). If you <a href="https://github.com/EFForg/https-everywhere/issues">report the problem to us</a>, we can try to fix it. In the meantime, you can disable the rule affecting that particular site in your own copy of HTTPS Everywhere by clicking on the HTTPS Everywhere toolbar button and unchecking the rule for that site.</p><p>You can also report the problem to the site, since they have the power to fix it!</p>
de: <p></p><a name="bugs"></a><p>Dies ist gelegentlich möglich aufgrund inkonsistenter Unterstützung für HTTPS auf Websites (z. B. Wenn eine Website HTTPS-Zugriff scheinbar unterstützt, aber Teile unvorhersehbar nicht funktionieren). Wenn Sie das Problem an uns gemeldet haben, können wir versuchen, es zu beheben. In der Zwischenzeit können Sie die Regel auf, dass bestimmte Website in Ihr eigenes Exemplar von HTTPS Everywhere auswirken, indem die HTTPS Everywhere-Symbolleisten-Schaltfläche anklicken und deaktivieren die Regel für diese Website deaktivieren. Sie können das Problem auch auf der Website melden, denn sie die Macht haben, es zu beheben!

# 294][field_questions][1][question
source: Why is HTTPS Everywhere preventing me from joining this hotel/school/other wireless network?
de: Warum hindert mich HTTPS Everywhere daran, dieses Hotel/Schule/Sonstiges-wireless-Netzwerk beitreten?

# 294][field_questions][1][answer
source: <p></p><a name="captiveportal"></a><p>Some wireless networks hijack your HTTP connections when you first join them, in order to demand authentication or simply to try to make you agree to terms of use. HTTPS pages are protected against this type of hijacking, which is as it should be. If you go to a website that isn't protected by HTTPS Everywhere (currently, nytimes.com is one such site) that will allow your connection to be captured and redirected to the authentication or terms of use page.</p>
de: <p></p><a name="captiveportal"></a><p>Einige drahtlose Netzwerke unterbrechen Ihre HTTP-Verbindungen, um eine Authentifizierung zu erzwingen oder ein Einverständnis von Nutzungsbedingungen zu bekommen. HTTPS-Seiten sind gegen diese Art von Missbrauch geschützt, so wie es sein sollte. Wenn Sie eine Website aufrufen, die nicht mit HTTPS Everywhere geschützt ist (derzeit, nytimes.com ist ein solches Beispiel), ist es Möglich, dass die Verbindung erfasst und zu einer Seite zur Anmeldung oder Annahme von Nutzungsbedienungen umgeleitet werden.

# 294][field_questions][2][question
source: Will there be a version of HTTPS Everywhere for IE, Safari, or some other browser?
de: Wird es eine Version von HTTPS Everywhere für IE, Safari oder einige andere Browser geben?

# 294][field_questions][2][answer
source: <p><a name="platform"></a> As of early 2012, the Safari extension API does not offer a way to perform secure rewriting of http requests to https. But if you happen to know a way to perform secure request rewriting in these browsers, feel free to let us know at <tt>https-everywhere at EFF.org</tt> (but note that modifying <tt>document.location</tt> or <tt>window.location</tt> in JavaScript is not secure).</p>
de: Ab Anfang 2012 bietet die Safari-Erweiterung API keine Methode für sichere Umschreiben von http-Anforderungen zu https. Aber wenn Sie zufällig eine Methode für sichere Umschreiben von Requests in diesen Browsern kennen, zögern Sie nicht uns über https-everywhere at EFF.org zu kontaktieren (aber beachten Sie, dass Änderungen an document.location oder window.location in JavaScript nicht sicher ist).

# 294][field_questions][3][question
source: Why use a whitelist of sites that support HTTPS? Why can't you try to use HTTPS for every last site, and only fall back to HTTP if it isn't available?
de: Warum wird eine whitelist mit Websites welche die HTTPS-Unterstützung anbieten genutzt? Warum versuchen können nicht Sie, für jeden letzten Website HTTPS zu verwenden, und nur zurückgreifen auf HTTP wenn es nicht verfügbar ist?

# 294][field_questions][3][answer
source: <p><a name="automatic-https"></a> There are several problems with the idea of trying to automatically detect HTTPS on every site. There is no guarantee that sites are going to give the same response via HTTPS that they give via HTTP. As of 2015, Forbes is a good example of this problem: compare these <a href="http://forbes.com">HTTP</a> and <a href="https://forbes.com">HTTPS</a> responses. Also, it's not possible to test for HTTPS in real time without introducing security vulnerabilities (What should the extension do if the HTTPS connection attempt fails? Falling back to insecure HTTP isn't safe). And in some cases, HTTPS Everywhere has to perform quite complicated transformations on URIs — for example until recently the Wikipedia rule had to turn an address like <tt>http://en.wikipedia.org/wiki/World_Wide_Web</tt> into one like <tt>https://secure.wikimedia.org/wikipedia/en/wiki/World_Wide_Web</tt> because HTTPS was not available on Wikipedia's usual domains.</p>
de: Es gibt mehrere Probleme mit der Herangehensweise, HTTPS auf jeder Seite automatisch zu erkennen. Es gibt keine Garantie, dass die Websites die gleiche Antwort per HTTPS zu geben, die sie über HTTP geben. Forbes im Jahre 2015 ist ein gutes Beispiel für dieses Problem: Diese HTTP- und HTTPS-Antworten zu vergleichen. Außerdem ist es nicht möglich, für HTTPS in Echtzeit zu testen, ohne Sicherheitslücken einzuführen (was soll die Erweiterung tun, wenn der HTTPS-Verbindungsversuch fehlschlägt? Zurückgreifen auf unsicheres HTTP ist nicht sicher). Und in einigen Fällen muss HTTPS Everywhere ziemlich komplizierte Transformationen auf URIs durchführen – zum Beispiel hatte bis vor kurzem die Wikipedia-Regel die Aufgabe, eine Adresse wie http://en.wikipedia.org/wiki/World_Wide_Web in eine ähnliche https://secure.wikimedia.org/wikipedia/en/wiki/World_Wide_Web zu verwandeln, da HTTPS auf Wikipedias üblichen Domains nicht verfügbar war.

# 294][field_questions][4][question
source: How do I get rid of/move the HTTPS Everywhere button in the toolbar?
de: Wie ich loswerden / HTTPS Everywhere-Schaltfläche in der Symbolleiste verschieben?

# 294][field_questions][4][answer
source: <p><a name="toolbar"></a> The HTTPS Everywhere button is useful because it allows you to see, and disable, a ruleset if it happens to be causing problems with a site. But if you'd rather disable it, go to View-&gt;Toolbars-&gt;Customize, and drag the button out of the toolbar into the Addons bar at the bottom of the page. Then you can hide the Addons bar. (In theory you should be able to drag it into the tray of available icons too, but that may trigger <a href="https://trac.torproject.org/projects/tor/ticket/6276">this bug</a>.</p>
de: Die HTTPS Everywhere-Schaltfläche ist nützlich, da Sie das deaktivieren eines Regelsatzes ermöglicht, falls es zu Problemen mit einer Webseite kommt. Aber wenn Sie es lieber sperren würden, gehen Sie auf View -&gt; Toolbars -&gt; Customize, und ziehen Sie die Schaltfläche aus der Symbolleiste heraus in die Addons-Leiste am unteren Rand der Seite. Dann können Sie die Addons-Leiste ausblenden. (In der Theorie sollte man in der Lage, es in die tray der verfügbaren Symbole zu ziehen, aber, die diesen Fehler auslösen können.

# 294][field_questions][5][question
source: When does HTTPS Everywhere protect me? When does it not protect me?
de: Wann schützt HTTPS Everywhere mich? Wann schützt HTTPS Everywhere mich nicht?

# 294][field_questions][5][answer
source: <a name="where"></a> HTTPS Everywhere protects you only when you are using <em>encrypted portions of supported web sites</em>. On a supported site, it will automatically activate HTTPS encryption for all known supported parts of the site (for some sites, this might be only a portion of the entire site). For example, if your web mail provider does not support HTTPS at all, HTTPS Everywhere can't make your access to your web mail secure. Similarly, if a site allows HTTPS for text but not images, someone might be able to see which images your browser loads and guess what you're accessing. HTTPS Everywhere depends entirely on the security features of the individual web sites that you use; it <em>activates</em> those security features, but it can't <em>create</em> them if they don't already exist. If you use a site not supported by HTTPS Everywhere or a site that provides some information in an insecure way, HTTPS Everywhere can't provide additional protection for your use of that site. Please remember to check that a particular site's security is working to the level you expect before sending or receiving confidential information, including passwords. One way to determine what level of protection you're getting when using a particular site is to use a packet-sniffing tool like <a href="http://www.wireshark.org/">Wireshark</a> to record your own communications with the site. The resulting view of your communications is about the same as what an eavesdropper on your wifi network or at your ISP would see. This way, you can determine whether some or all of your communications would be protected; however, it may be quite time-consuming to make sense of the Wireshark output with enough care to get a definitive answer. You can also turn on the "Block all HTTP requests" feature for added protection. Instead of loading insecure pages or images, HTTPS Everywhere will block them outright.
de: <a name="where"></a> HTTPS Everywhere schützt Sie nur bei Verwendung von verschlüsselten Teilen der unterstützten Web-Sites. Auf einer unterstützten Website wird es automatisch HTTPS-Verschlüsselung für alle bekannten und unterstützten Teile der Site aktivieren (für einige Websites ist dies möglicherweise nur einen Teil der gesamten Site). Beispielsweise, wenn Ihr Web-Mail-Dienstanbieter überhaupt kein HTTPS unterstützt, kann HTTPS Everywhere Ihren Zugang zu Ihrem Webmail auch nicht sicher machen. Ebenso, wenn eine Website HTTPS für Text aber Bilder nicht erlaubt, kann jemanden möglicherweise sehen, welche Bilder Ihr Browser lädt und erraten, was Sie tun. HTTPS Everywhere hängt ganz von den Sicherheits-Features der einzelnen Websites die Sie verwenden ab; es aktiviert die Sicherheits-Features, aber es kann sie nicht generieren, wenn sie nicht bereits vorhanden sind. Wenn Sie eine Website besuchen, die nicht von HTTPS Everywhere unterstützt wird oder eine Website, die einige Informationen auf unsichere Weise verwenden, kann HTTPS Everywhere keinen zusätzlichen Schutz für Ihre Nutzung dieser Seite bieten. Bitte denken Sie daran, zu prüfen, ob eine Website eine Sicherheit auf der Ebene anbietet, die Ihren Erwartungen entspricht, bevor vertraulichen Informationen, einschließlich Kennwörter, gesendet oder empfangen werden. Um herauszufinden, welches Schutzniveau Sie bekommen, wenn Sie eine bestimmte Website verwenden, ist eine Packet-sniffing Tool wie <a href="http://www.wireshark.org/">Wireshark</a> geeignet, um Ihre eigene Kommunikation mit der Website aufnehmen. Die resultierende Aufzeichnung Ihrer Kommunikation ist ungefähr das gleiche, was ein Lauscher auf Ihr Wifi-Netzwerk oder bei Ihrem ISP sehen würde. Auf diese Weise können Sie bestimmen, ob Teile oder ihre gesamte Kommunikation geschützt würde; jedoch kann es sehr zeitaufwändig sein, die WireShark Aufzeichnung zu verstehen und eine definitive Aussage zu erhalten. Sie können auch die Funktion "Blocke alle HTTP-Anforderungen" aktivieren um zusätzlichen Schutz zu erhalten. Statt unsichere Seiten oder Bilder zu laden wird HTTPS Everywhere diese direkt blockieren.

# 294][field_questions][6][question
source: What does HTTPS Everywhere protect me against?
de: Gegen was schützt HTTPS Everywhere mich?

# 294][field_questions][6][answer
source: <p></p><a name="threats"></a><p>On supported parts of supported sites, HTTPS Everywhere enables the sites' HTTPS protection which can protect you against eavesdropping and tampering with the contents of the site or with the information you send to the site. Ideally, this provides some protection against an attacker learning the content of the information flowing in each direction — for instance, the text of e-mail messages you send or receive through a webmail site, the products you browse or purchase on an e-commerce site, or the particular articles you read on a reference site.</p><p>However, HTTPS Everywhere <strong>does not conceal the identities of the sites you access</strong>, the amount of time you spend using them, or the amount of information you upload or download from a particular site. For example, if you access http://www.eff.org/issues/nsa-spying and HTTPS Everywhere rewrites it to https://www.eff.org/issues/nsa-spying, an eavesdropper can still trivially recognize that you are accessing www.eff.org (but might not know which issue you are reading about). In general, the entire hostname part of the URL remains exposed to the eavesdropper because this must be sent repeatedly in unencrypted form while setting up the connection. Another way of saying this is that HTTPS was never designed to conceal the identity of the sites that you visit.</p><p>Researchers have also shown that it may be possible for someone to figure out more about what you're doing on a site merely through careful observation of the amount of data you upload and download, or the timing patterns of your use of the site. A simple example is that if the site only has one page of a certain total size, anyone downloading exactly that much data from the site is probably accessing that page.</p><p>If you want to protect yourself against monitoring of the sites you visit, consider using HTTPS Everywhere together with software like <a href="https://www.torproject.org/">Tor</a>.</p>
de: <p></p><a name="threats"></a><p> Auf unterstützten Teilen der unterstützten Seiten wird HTTPS everywhere die HTTPS Sicherheit ermöglichen und dich damit gegen Überwachung und Unterbrechung der Inhalte von der Seite oder zu der Seite zu schützen. Dies bietet im Idealfall etwas Schutz gegen einen Angreifer, die den Inhalt der Informationen in beide Richtungen fließen lernen – zum Beispiel den Text der E-mail-Nachrichten Sie senden oder empfangen über ein Webmail-Website, die Produkte, die Sie durchsuchen oder auf e-Commerce-Website erwerben, oder die bestimmten Artikel Sie auf einem Referenz-Site lesen. HTTPS Everywhere ist jedoch nicht die Identität von Websites, auf die Sie zugreifen, die Zeitspanne verbergen verbringen Sie mit ihnen oder die Menge der Informationen, die Sie hochladen oder Herunterladen von einem bestimmten Ort.

# 294][field_questions][9][answer
source: <p></p><a name="expensive"></a><p>It can be, but some sites have been pleasantly surprised to see how practical it can be. Also, experts at Google are currently implementing several enhancements to the TLS protocol that make HTTPS dramatically faster; if these enhancements are added to the standard soon, the speed gap between the two should almost disappear. See <a href="http://www.imperialviolet.org/2010/06/25/overclocking-ssl.html">Adam Langley's description of the HTTPS deployment situation</a> for more details on these issues. Notably, Langley states: "In order to [enable HTTPS by default for Gmail] we had to deploy no additional machines and no special hardware. On our production frontend machines, SSL/TLS accounts for less than 1% of the CPU load, less than 10KB of memory per connection and less than 2% of network overhead."</p><p>It used to be expensive to purchase a certificate for HTTPS usage, but they can now be obtained for free from <a href="http://www.startssl.com/">StartSSL</a> or <a href="https://buy.wosign.com/free/">WoSign</a>, and soon free certificate will be available from Let's Encrypt as well.</p>
de: Insbesondere besagt Langley: "Um [HTTPS standardmäßig für Google Mail aktivieren] mussten wir keine zusätzlichen Maschinen und keine spezielle Hardware bereitstellen. Auf unsere Produktionsmaschinen Frontend load SSL/TLS-Konten für weniger als 1 % der CPU, weniger als 10 KB Arbeitsspeicher pro Verbindung und weniger als 2 % des Netzwerk-Overhead." Früher teuer zu kaufen ein Zertifikat für die HTTPS-Nutzung, aber sie können jetzt kostenlos von StartSSL oder WoSign abgerufen werden, und bald Kostenloses Zertifikat werden von Let's verschlüsseln als auch.

# 294][field_questions][10][question
source: Why should I use HTTPS Everywhere instead of just typing https:// at the beginning of site names?
de: Warum sollte ich verwenden HTTPS Everywhere statt einfach https:// zu Beginn des Seiten-Namen eingeben?

# 294][field_questions][10][answer
source: <p><a name="why"></a> Even if you normally type https://, HTTPS Everywhere might protect you if you occasionally forget. Also, it can rewrite other people's links that you follow. For instance, if you click on a link to <a href="http://en.wikipedia.org/wiki/EFF_Pioneer_Award">http://en.wikipedia.org/wiki/EFF_Pioneer_Award</a>, HTTPS Everywhere will automatically rewrite the link to <a href="https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award">https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award</a>. Thus, you might get some protection even if you wouldn't have noticed that the target site is available in HTTPS.</p>
de: Selbst wenn Sie normalerweise https:// eingeben, möglicherweise HTTPS überall Sie schützen, wenn Sie gelegentlich vergessen. Es kann auch anderer Leute Links umschreiben, welche Sie benutzen.

# 294][field_questions][11][answer
source: <p><a name="sslstrip"></a> HTTPS Everywhere, like the <a href="http://www.w3.org/Security/wiki/Strict_Transport_Security">HSTS protocol</a>, tries to address an attack called <a href="http://www.thoughtcrime.org/software/sslstrip/">SSL stripping</a>. Users are only protected against the SSL stripping attack if their browsers don't even <em>try</em> to connect to the HTTP version of the site — even if the site would have redirected them to the HTTPS version. With HTTPS Everywhere, the browser won't even attempt the insecure HTTP connection, even if that's what you ask it to do. (Note that HTTPS Everywhere currently does not include a comprehensive list of such sites, which are mainly financial institutions.)</p>
de: Mit HTTPS Everywhere wird der Browser nicht einmal die unsichere HTTP-Verbindung versuchen, selbst wenn Sie das von ihm verlangen. (Beachten Sie, dass HTTPS Everywhere derzeit keine umfassende Liste der Seiten, die vor allem Finanzinstitute sind.)

# 294][field_questions][12][question
source: What do the different colors for rulesets in the toolbar menu mean?
de: Was bedeuten die verschiedenen Farben für Regelsätze im Symbolleistenmenü?

# 294][field_questions][12][answer
source: <p></p><a name="colors"></a><p>The colors are:</p><p>Dark Green: ruleset was active in loading the resources in the current page.</p><p>Light Green: ruleset was ready to prevent HTTP loads in the current page, but everything that the ruleset would have covered was loaded over HTTPS anyway (in the code, light green is called a "moot rule").</p><p>Dark Brown or Clockwise Red Arrow: broken rule -- the ruleset is active but the server is redirecting at least some URLs back from HTTPS to HTTP.</p><p>Gray: the ruleset is disabled.</p>
de: Die Farben sind: Dark Green: Regelsatz war aktiv in der Ressourcen in der aktuellen Seite geladen. Hellgrün: Regelsatz war bereit, HTTP Lasten auf der aktuellen Seite zu verhindern, aber alles, das der Regelsatz abgedeckt würde sowieso über HTTPS geladen wurde (im Code ist hellgrün "fraglich-Regel" genannt). Dunkel braun oder im Uhrzeigersinn roter Pfeil: defekte Regel--Ruleset ist aktiv, aber der Server ist zumindest einige URLs von HTTPS auf HTTP umleiten. Gray: der Regelsatz ist deaktiviert.

# 294][field_questions][13][question
source: I'm having a problem installing the browser extension.
de: Ich habe ein Problem, die Browsererweiterung installieren.

# 294][field_questions][13][answer
source: <p><a name="problems-installing"></a> Some people report that installing HTTPS Everywhere gives them the error: "The addon could not be downloaded because of a connection failure on www.eff.org." This may be caused by Avast anti-virus, which blocks installation of browser extensions. You may be able to <a href="https://addons.mozilla.org/en-US/firefox/addon/https-everywhere/">install from addons.mozilla.org instead</a>.</p>
de: Manche Leute berichten, dass die Installation von HTTPS Everywhere gibt ihnen den Fehler:

# 294][field_questions][14][question
source: How do I add my own site to HTTPS Everywhere?
de: Wie füge ich meiner eigenen Website zu HTTPS Everywhere hinzu?

# 294][field_questions][14][answer
source: We're excited that you want your site in HTTPS Everywhere! However, remember that not everyone who visits your site has our extension installed. If you run a web site, you can make it default to HTTPS for everyone, not just HTTPS Everywhere users. And it's less work! The steps you should take, in order, are: <ol><li>Set up a <a href="https://www.sslshopper.com/apache-redirect-http-to-https.html">redirect</a> from HTTP to HTTPS on your site.</li> <li><a href="https://raymii.org/s/tutorials/HTTP_Strict_Transport_Security_for_Apache_NGINX_and_Lighttpd.html">Add the Strict-Transport-Security (HSTS) header on your site</a>.</li> <li><a href="https://hstspreload.appspot.com/">Add your site to the HSTS Preload list</a>.</li> </ol> These steps will give your site much better protection that adding it to HTTPS Everywhere. Generally speaking, once you are done, there is no need to add your site to HTTPS Everywhere. However, if you would still like to, please follow the <a href="https://eff.org/https-everywhere/rulesets">instructions on writing rulesets</a>, and indicate that you are the author of the web site when you submit your pull request.
de: Wir freuen uns, dass Sie Ihre Website in HTTPS Everywhere hinzufügen möchten! Beachten Sie jedoch, dass nicht jeder, der Ihre Website besucht, unsere Erweiterung installiert hat. Wenn Sie eine Website ausführen, machen Sie es standardmäßig auf HTTPS für alle verfügbar, nicht nur HTTPS Everywhere Benutzer. Und es ist weniger Arbeit! Die Schritte, die Sie beachten sollten (in dieser Reihenfolge) sind: Richten Sie eine Umleitung von HTTP auf HTTPS auf Ihrer Website. Diese Schritte werden Ihre Website viel besseren Schutz das Hinzufügen zu HTTPS Everywhere geben.
