Repository: deralexxx/www-l10n
Catalog: translations/*/JobID25_*.xlf
Languages: de

# 300][menu:item:1956:title
source: Creating HTTPS Everywhere Rulesets
de: Erzeugen von HTTPS Everywhere Regeln

# 302][menu:item:1955:title
source: How to Deploy HTTPS Correctly
de: HTTPS Everywhere richtig bereitstellen

# 303][menu:item:1957:title
source: Report Bugs / Hack On The Code
de: Fehler melden / Hack the Code

# 305][singular
source: HTTPS Everywhere is a Firefox, Chrome, and Opera extension that encrypts your communications with many major websites, making your browsing more secure.
de: HTTPS Everywhere ist eine Firefox-, Chrome- und Opera-Erweiterung, welche Ihre Kommunikation mit vielen großen Websites verschlüsselt und damit Ihre Surfgewohnheiten sicherer macht.

# 306][singular
source: Encrypt the web: Install HTTPS Everywhere today.
de: Im Web zu verschlüsseln: Installieren Sie HTTPS Everywhere heute.

# 307][singular
source: Install in Firefox
de: In Firefox installieren

# 308][singular
source: Install in Firefox for Android
de: In Firefox für Android installieren

# 309][singular
source: Install in Chrome
de: Installieren in Chrome

# 310][singular
source: Install in Opera
de: In Opera installieren

# 311][singular
source: Recent Releases
de: Aktuelle Versionen

# 312][singular
source: Stable releases for Firefox:
de: Stabile Versionen für Firefox:

# 313][singular
source: Stable releases for Chrome, Chromium, and Opera 15+:
de: Stabile Versionen für Chrome, Chrome und Opera 15 +:

# 315][singular
source: Note: If you install the standalone .crx (i.e. not from the Chrome Web Store), and you are using Windows, Chrome will automatically disable the extension on each restart. You may be able to work around by using developer mode. See <a href="https://github.com/EFForg/https-everywhere/issues/819">this issue</a>.
de: Hinweis: Wenn Sie den Standalone-.crx (also nicht aus dem Chrome Web Store) installieren und Sie Windows verwenden, wird Chrome die Erweiterung bei jedem Neustart automatisch deaktivieren. Sie können versuchen, dies mithilfe des Entwicklermodus zu umgehen. Siehe <a href="https://github.com/EFForg/https-everywhere/issues/819">Problem hier</a>.

# 316][singular
source: Featured Tools
de: Empfohlene Werkzeuge

# 317][singular
source: All Tools
de: Alle Werkzeuge

# 318][singular
source: Yes
de: Ja

# 319][singular
source: No
de: Nein

# 320][singular
source: Encrypted in transit?
de: Bei der Übertragung verschlüsselt?

# 321][singular
source: Encrypted so the provider can’t read it?
de: Verschlüsselt, so dass der Anbieter nicht lesen kann?

# 322][singular
source: Can you verify contacts’ identities?
de: Kann man die Identität von Kontakten überprüfen?

# 323][singular
source: Are past comms secure if your keys are stolen?
de: Ist Kommunikation aus der Vergangenheit sicher, falls die Schlüssel gestohlen werden?

# 324][singular
source: Is the code open to independent review?
de: Ist der Code für unabhängige Überprüfung offen?

# 325][singular
source: Is security design properly documented?
de: Ist das Sicherheitskonzept ist ordnungsgemäß dokumentiert?

# 326][singular
source: Has there been any recent code audit?
de: Gab es einen aktuellen Code-Audit?
